CASE_I/timeScheme/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicOversetFvMesh; 

solver          multiSolidBodyMotionSolver;

# include "../system/parameters"

multiSolidBodyMotionSolverCoeffs
{
    movingZone
    {
        solidBodyMotionFunction rotatingMotion;  
        
        rotatingMotionCoeffs
        {
            origin      (0 0 0);
            axis        (0 0 1);
            omega       $U_rad;
        }
    }
}


// ************************************************************************* //
